DarrylGamroth/smartstepper/drivers/spi_tt/spi_ll_stm32_tt.c
		if (!spi_stm32_is_subghzspi(dev)) {
			/* Move pins to sleep state */
			err = pinctrl_apply_state(config->pcfg, PINCTRL_STATE_SLEEP);
			if ((err < 0) && (err != -ENOENT)) {
				/*
				 * If returning -ENOENT, no pins where defined for sleep mode :
				 * Do not output on console (might sleep already) when going to
				 * sleep,
				 * "SPI pinctrl sleep state not available"
				 * and don't block PM suspend.
				 * Else return the error.
				 */
				return err;
			}
		}
		break;
	default:
		return -ENOTSUP;
	}

	return 0;
}
#endif /* CONFIG_PM_DEVICE */



/* Timer-Triggered DMA Functions */

int spi_stm32_configure_timer_dma(const struct device *dev,
			       const struct spi_config *config,
			       const struct spi_buf *tx_buf,
			       const struct spi_buf *rx_buf)
{
	struct spi_stm32_data *data = dev->data;
	int ret;

	if (!tx_buf || !rx_buf) {
		return -EINVAL;
	}

	/* Buffers should be the same size for circular operation */
	if (tx_buf->len != rx_buf->len) {
		return -EINVAL;
	}

	/* Ensure DMA is available for both RX and TX */
	if (!data->dma_rx.dma_dev || !data->dma_tx.dma_dev) {
		return -ENOTSUP;
	}

#ifdef CONFIG_DCACHE
	if ((tx_buf != NULL && !spi_buf_in_nocache(tx_buf)) ||
		(rx_buf != NULL && !spi_buf_in_nocache(rx_buf))) {
		return -EFAULT;
	}
#endif /* CONFIG_DCACHE */

	spi_context_lock(&data->ctx, false, NULL, NULL, config);

	spi_stm32_pm_policy_state_lock_get(dev);

	/* Configure SPI for timer-triggered operation */
	ret = spi_stm32_configure(dev, config, true);
	if (ret) {
		goto end;
	}

	/* Set up timer-triggered DMA context */
	data->timer_dma_active = false;

	/* Use existing DMA load functions - they will configure circular mode */
	ret = spi_stm32_dma_rx_load(dev, (uint8_t *)rx_buf->buf, rx_buf->len);
	if (ret) {
		LOG_ERR("Failed to load timer RX DMA: %d", ret);
		goto end;
	}

	ret = spi_stm32_dma_tx_load(dev, (const uint8_t *)tx_buf->buf, tx_buf->len);
	if (ret) {
		LOG_ERR("Failed to load timer TX DMA: %d", ret);
		goto end;
	}

	/* Call dma_stop to disable interrupts */
	ret = dma_stop(data->dma_rx.dma_dev, data->dma_rx.channel);
	if (ret) {
		LOG_ERR("Failed to stop timer RX DMA: %d", ret);
	}

	int tx_ret = dma_stop(data->dma_tx.dma_dev, data->dma_tx.channel);
	if (tx_ret) {
		LOG_ERR("Failed to stop timer TX DMA: %d", tx_ret);
		ret = ret ? ret : tx_ret;  /* Preserve first error */
	}

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
	/* For H7 series, configure transfer size */
	uint8_t frame_size = SPI_WORD_SIZE_GET(config->operation) / 8;
	uint32_t frames = rx_buf->len / frame_size;
	LL_SPI_SetTransferSize(cfg->spi, frames);
#endif

	LOG_DBG("Timer DMA setup complete: tx_buf=%p, rx_buf=%p, size=%u",
		tx_buf->buf, rx_buf->buf, rx_buf->len);

end:
	if (ret) {
		spi_context_release(&data->ctx, ret);
		spi_stm32_pm_policy_state_lock_put(dev);
	}
	/* Context remains locked for timer mode - released in stop_timer_dma */
	/* PM policy lock also remains active until stop */
	return ret;
}

int spi_stm32_start_timer_dma(const struct device *dev)
{
	const struct spi_stm32_config *cfg = dev->config;
	struct spi_stm32_data *data = dev->data;
	SPI_TypeDef *spi = cfg->spi;
	int ret;

	if (data->timer_dma_active) {
		return -EALREADY;
	}

	if (!data->timer_rx_buf->buf || !data->timer_tx_buf->buf) {
		return -ENODATA;
	}

	/* Start RX DMA transfer */
	ret = dma_start(data->dma_rx.dma_dev, data->dma_rx.channel);
	if (ret) {
		LOG_ERR("Failed to start timer RX DMA: %d", ret);
		return ret;
	}

	/* Start TX DMA transfer */
	ret = dma_start(data->dma_tx.dma_dev, data->dma_tx.channel);
	if (ret) {
		LOG_ERR("Failed to start timer TX DMA: %d", ret);
		/* Stop RX DMA if TX fails */
		dma_stop(data->dma_rx.dma_dev, data->dma_rx.channel);
		return ret;
	}

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
	/* The SPI peripheral will initiate RX DMA requests */
	LL_SPI_EnableDMAReq_RX(spi);

	LL_SPI_Enable(spi);

	/* For H7: Start master transfer if not half-duplex RX */
	uint32_t transfer_dir = LL_SPI_GetTransferDirection(spi);
	if (transfer_dir != LL_SPI_HALF_DUPLEX_RX &&
		LL_SPI_GetMode(spi) == LL_SPI_MODE_MASTER) {
		LL_SPI_StartMasterTransfer(spi);
		while (!LL_SPI_IsActiveMasterTransfer(spi)) {
			/* Wait for transfer to start */
		}
	}
#else
	LL_SPI_Enable(spi);

	/* The SPI peripheral will initiate RX DMA requests */
	LL_SPI_EnableDMAReq_RX(spi);
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi) */

	data->timer_dma_active = true;

	LOG_DBG("Timer DMA started successfully");
	return 0;
}

int spi_stm32_stop_timer_dma(const struct device *dev)
{
	const struct spi_stm32_config *cfg = dev->config;
	struct spi_stm32_data *data = dev->data;
	SPI_TypeDef *spi = cfg->spi;
	int ret;

	if (!data->timer_dma_active) {
		return -EALREADY;
	}

	/* Stop RX DMA transfer */
	ret = dma_stop(data->dma_rx.dma_dev, data->dma_rx.channel);
	if (ret) {
		LOG_ERR("Failed to stop timer RX DMA: %d", ret);
	}

	/* Stop TX DMA transfer */
	int tx_ret = dma_stop(data->dma_tx.dma_dev, data->dma_tx.channel);
	if (tx_ret) {
		LOG_ERR("Failed to stop timer TX DMA: %d", tx_ret);
		ret = ret ? ret : tx_ret;  /* Preserve first error */
	}

	/* Disable SPI (no DMA requests to disable - timer controlled DMA) */
	LL_SPI_Disable(spi);

	data->timer_dma_active = false;

	/* Release SPI context that was locked during setup */
	spi_context_release(&data->ctx, ret);

	spi_stm32_pm_policy_state_lock_put(dev);

	LOG_DBG("Timer DMA stopped");
	return ret;
}

bool spi_stm32_is_timer_dma_active(const struct device *dev)
{
	struct spi_stm32_data *data = dev->data;
	return data->timer_dma_active;
}

bool spi_stm32_is_timer_dma_complete(const struct device *dev)
{
	struct spi_stm32_data *data = dev->data;

	if (!data->timer_dma_active) {
		return false;
	}

	/* Get current DMA status to check if transfer completed */
	struct dma_status dma_stat;
	int ret = dma_get_status(data->dma_rx.dma_dev, data->dma_rx.channel, &dma_stat);
	if (ret) {
		LOG_ERR("Failed to get DMA status: %d", ret);
		return false;
	}

	/* In circular mode, check if DMA has completed at least one full cycle */
	/* This is useful for FOC ADC ISR to know if fresh encoder data is available */
	return (dma_stat.total_copied > 0);
}

static DEVICE_API(spi_tt, tt_api_funcs) = {
	.config = spi_stm32_configure_timer_dma,
	.start = spi_stm32_start_timer_dma,
	.stop = spi_stm32_stop_timer_dma,
	.is_complete = spi_stm32_is_timer_dma_complete,
};

#ifdef CONFIG_SPI_STM32_TT_INTERRUPT
#define STM32_SPI_IRQ_HANDLER_DECL(id)					\
	static void spi_stm32_irq_config_func_##id(const struct device *dev)
#define STM32_SPI_IRQ_HANDLER_FUNC(id)					\
	.irq_config = spi_stm32_irq_config_func_##id,
#define STM32_SPI_IRQ_HANDLER(id)					\
static void spi_stm32_irq_config_func_##id(const struct device *dev)		\
{									\
	IRQ_CONNECT(DT_INST_IRQN(id),					\
		    DT_INST_IRQ(id, priority),				\
		    spi_stm32_isr, DEVICE_DT_INST_GET(id), 0);		\
	irq_enable(DT_INST_IRQN(id));					\
}
#else
#define STM32_SPI_IRQ_HANDLER_DECL(id)
#define STM32_SPI_IRQ_HANDLER_FUNC(id)
#define STM32_SPI_IRQ_HANDLER(id)
#endif /* CONFIG_SPI_STM32_TT_INTERRUPT */

